// ## 2022/02/14 # 江东新风 # 部分常量中文化 ##
// ## 2022/02/13 # 江东新风 # 重写函数，进修的特技添加对应能力和适性限制 ##
// ## 2020/09/21 # 江东新风 # ch::add_tp替换 ##
// ## 2020/09/16 # 江东新风 # 使用条件对君主行动状态进行判定 ##
// ## 2020/08/09 # 氕氘氚 # 加入【培养】菜单 ##
/**
원본 제작자 : HoneyBee
수정자 : 바바부부
설명 : 특정 무장에게 랜덤 특기를 부여함. 양자 스크립트 개조
**/

namespace 特技_进修
{
	// ================ CUSTOMIZE ================		
	const int ACTION_COST = 20;     	// (행동력 필요량: 기본 50 설정)	
	const int GOLD_COST = 1000;
	const int TP_COST = 500;    	   	// (기교P 필요량: 기본 100 설정)		
	const int KEY = pk::hash("特技进修");
	// ===========================================	

	class Main
	{
		bool 调试模式 = false;
		pk::building@ building_;
		int check_result_;

		Main()
		{
			add_menu();
		}

		void add_menu()
		{
			pk::menu_item item;
			item.menu = global_menu::菜单_培养;
			item.init = pk::building_menu_item_init_t(init);
			item.is_enabled = pk::menu_item_is_enabled_t(isEnabled);
			item.get_text = pk::menu_item_get_text_t(getText);
			item.get_desc = pk::menu_item_get_desc_t(getDesc);
			item.handler = pk::menu_item_handler_t(handler);
			pk::add_menu_item(item);
		}

		void init(pk::building@ building)
		{
			@building_ = @building;
			auto person_list = pk::get_idle_person_list(building_);
			check_result_ = check_avaliable(building, person_list);
		}

		string getText()
		{
			return pk::encode("进修");
		}

		bool isEnabled()
		{
			if (check_result_ != 0) return false;
			else return true;
		}

		string getDesc()
		{
			switch (check_result_)
			{
			case 1: return pk::encode("没有可执行的武将. ");
			case 2: return pk::encode(pk::format("行动力不足 (必须 {} 行动力)", ACTION_COST));
			case 3: return pk::encode(pk::format("资金不足 (至少 {} 资金)", GOLD_COST));
			case 4: return pk::encode(pk::format("技巧值不足 (至少 {} 技巧)", TP_COST));
			case 0: return pk::encode(pk::format("让武将进修学习特技.(消耗：(金{}+技巧{}+行动力{}))", GOLD_COST, TP_COST, ACTION_COST));
			default:
				return pk::encode("");
			}
			return pk::encode("");
		}

		int check_avaliable(pk::building@ building, pk::list<pk::person@> list)//之所以加入list是为了ai调用时不用重复计算，玩家菜单稍微多点操作问题不大
		{
			//pk::trace(pk::format("3.1:{}{}{}{}", pk::enemies_around(building), list.count, pk::get_district(building.get_district_id()).ap < ACTION_COST, pk::get_gold(building) < GOLD_COST));
			if (list.count == 0) return 1;
			else if (pk::get_district(building.get_district_id()).ap < ACTION_COST) return 2;
			else if (pk::get_gold(building) < GOLD_COST) return 3;
			else if (pk::get_force(building.get_force_id()).tp < TP_COST) return 4;
			else return 0;
		}

		bool handler()
		{
			if (pk::choose({ pk::encode(" 是 "), pk::encode(" 否 ") }, pk::encode(pk::format("是否让所属武将进修学习?\n(技巧点{})", TP_COST)), pk::get_person(武将_文官)) == 1)
			{
				return false;
			}

			bool person_confirm = false;

			auto person_list = pk::get_idle_person_list(building_);
			pk::person@monster;
			string monster_name = "";
			while (!person_confirm)
			{
				// 무장 선택 창을 열어서 선택하기
				auto person_sel = pk::person_selector(pk::encode("选择武将"), pk::encode("请选择要进修的武将."), person_list, 1, 1);
				if (person_sel.count == 0) return false;
				// 무장 선택
				@monster = @person_sel[0];

				// 선택된 무장의 이름
				monster_name = pk::decode(pk::get_name(monster));

				person_confirm = pk::yes_no(pk::encode(pk::format("是否让\x1b[1x{}\x1b[0x进修学习特技?", monster_name)));
			}

			skill_study(monster);
			monster.update();

			pk::message_box(pk::encode("我将以学习的新特技来为主公战斗."), monster);
			pk::message_box(pk::encode(pk::format("\x1b[1x{}\x1b[0x获得了新的特技\x1b[1x{}\x1b[0x.", monster_name,pk::decode(pk::get_name(pk::get_skill(monster.skill))))));

			// 행동력 감소.
			auto district = pk::get_district(building_.get_district_id());
			pk::add_ap(district, -ACTION_COST);
			ch::add_tp(pk::get_force(building_.get_force_id()), -TP_COST, building_.get_pos());
			pk::add_gold(building_,-GOLD_COST,true);
			monster.action_done = true;

			return true;
		}

		void skill_study(pk::person@person)
		{
			//array<array<uint8>> 可学特技;// (4, array<uint8>(160, 255));
			array<uint8>可学特技level_1;
			array<uint8>可学特技level_2;
			array<uint8>可学特技level_3;
			array<uint8>可学特技level_4;
			for (int i = 0; i < 160; ++i)
			{
				bool include = true;
				for (int j = 0; j < 11; ++j)
				{
					if (j < 武将能力_末)
					{
						if (person.stat[j] < 特技需求[i][j])
						{
							include = false;
							break;
						}
					}
					else
					{
						if (uint8(person.tekisei[j- 武将能力_末]) < 特技需求[i][j])
						{
							include = false;
							break;
						}
					}
				}
				if (include)
				{
					pk::skill@ skill = pk::get_skill(i);
					if (pk::is_alive(skill))
					{
						int level = skill.level-1;
						//pk::trace("id:" + skill.get_id() + "level" + skill.level);
						switch (level)
						{
						case 0: 可学特技level_1.insertLast(i);
						case 1: 可学特技level_2.insertLast(i);
						case 2: 可学特技level_3.insertLast(i);
						case 3: 可学特技level_4.insertLast(i);
						}
					}
				}
			}
			int lucky = pk::rand(100);
			if (可学特技level_3.length() > 0)
			{
				if (可学特技level_4.length() > 0)
				{
					if (lucky > 95) person.skill = 可学特技level_4[pk::rand(可学特技level_4.length())];
					else if (lucky > 75) person.skill = 可学特技level_3[pk::rand(可学特技level_3.length())];
					else if (lucky > 45) person.skill = 可学特技level_2[pk::rand(可学特技level_2.length())];
					else person.skill = 可学特技level_1[pk::rand(可学特技level_1.length())];
				}
				else
				{
					if (lucky > 75) person.skill = 可学特技level_3[pk::rand(可学特技level_3.length())];
					else if (lucky > 45) person.skill = 可学特技level_2[pk::rand(可学特技level_2.length())];
					else person.skill = 可学特技level_1[pk::rand(可学特技level_1.length())];
				}
			}
			else
			{
				if (lucky > 45) person.skill = 可学特技level_2[pk::rand(可学特技level_2.length())];
				else person.skill = 可学特技level_1[pk::rand(可学特技level_1.length())];
			}


		}

	}
	const array<array<uint8>> 特技需求 = {
	{/*000飞将*//*统率*/80,/*武力*/100,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/2,/*戟*/2,/*弩*/2,/*马*/4,/*兵器*/0,/*水军*/0},
	{/*001遁走*//*统率*/0,/*武力*/0,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*002强行*//*统率*/70,/*武力*/0,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*003长驱*//*统率*/70,/*武力*/70,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/2,/*兵器*/0,/*水军*/0},
	{/*004推进*//*统率*/70,/*武力*/70,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/2},
	{/*005操舵*//*统率*/70,/*武力*/70,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/2},
	{/*006踏破*//*统率*/70,/*武力*/70,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*007运输*//*统率*/0,/*武力*/0,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*008用毒*//*统率*/70,/*武力*/70,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*009扫讨*//*统率*/70,/*武力*/70,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*010威风*//*统率*/80,/*武力*/90,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*011昂扬*//*统率*/70,/*武力*/70,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*012连战*//*统率*/80,/*武力*/90,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/3,/*戟*/3,/*弩*/2,/*马*/3,/*兵器*/0,/*水军*/0},
	{/*013急袭*//*统率*/70,/*武力*/70,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*014强袭*//*统率*/70,/*武力*/70,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/2},
	{/*015乱战*//*统率*/70,/*武力*/70,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/2,/*戟*/1,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*016待伏*//*统率*/0,/*武力*/0,/*智力*/80,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*017攻城*//*统率*/70,/*武力*/70,/*智力*/60,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/3,/*水军*/0},
	{/*018掎角*//*统率*/60,/*武力*/0,/*智力*/70,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*019擒拿*//*统率*/80,/*武力*/80,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*020精妙*//*统率*/70,/*武力*/0,/*智力*/80,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*021强夺*//*统率*/70,/*武力*/80,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*022攻心*//*统率*/80,/*武力*/80,/*智力*/70,/*政治*/0,/*魅力*/70,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*023驱逐*//*统率*/80,/*武力*/80,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/2,/*戟*/1,/*弩*/0,/*马*/2,/*兵器*/0,/*水军*/0},
	{/*024射程*//*统率*/0,/*武力*/0,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/3,/*水军*/0},
	{/*025骑射*//*统率*/70,/*武力*/70,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/3,/*兵器*/0,/*水军*/0},
	{/*026辅佐*//*统率*/0,/*武力*/0,/*智力*/0,/*政治*/70,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*027不屈*//*统率*/70,/*武力*/70,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*028金刚*//*统率*/70,/*武力*/70,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/2,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*029铁壁*//*统率*/70,/*武力*/70,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/2,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*030怒发*//*统率*/70,/*武力*/70,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*031藤甲*//*统率*/70,/*武力*/70,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/2,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*032幸运*//*统率*/0,/*武力*/0,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*033血路*//*统率*/70,/*武力*/80,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*034枪将*//*统率*/70,/*武力*/80,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/3,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*035戟将*//*统率*/70,/*武力*/80,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/3,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*036弓将*//*统率*/70,/*武力*/80,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/3,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*037骑将*//*统率*/70,/*武力*/80,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/3,/*兵器*/0,/*水军*/0},
	{/*038水将*//*统率*/70,/*武力*/80,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/3},
	{/*039勇将*//*统率*/70,/*武力*/90,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/2,/*戟*/0,/*弩*/2,/*马*/0,/*兵器*/0,/*水军*/3},
	{/*040神将*//*统率*/90,/*武力*/90,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/2,/*戟*/3,/*弩*/2,/*马*/2,/*兵器*/0,/*水军*/0},
	{/*041斗神*//*统率*/80,/*武力*/90,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/3,/*戟*/3,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*042枪神*//*统率*/80,/*武力*/90,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/4,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*043戟神*//*统率*/80,/*武力*/90,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/4,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*044弓神*//*统率*/80,/*武力*/90,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/4,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*045骑神*//*统率*/80,/*武力*/90,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/4,/*兵器*/0,/*水军*/0},
	{/*046工神*//*统率*/0,/*武力*/0,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/4,/*水军*/0},
	{/*047水神*//*统率*/80,/*武力*/90,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/4},
	{/*048霸王*//*统率*/90,/*武力*/100,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/2,/*戟*/2,/*弩*/2,/*马*/4,/*兵器*/0,/*水军*/2},
	{/*049疾驰*//*统率*/70,/*武力*/90,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/3,/*兵器*/0,/*水军*/0},
	{/*050射手*//*统率*/70,/*武力*/70,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/2,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*051猛者*//*统率*/0,/*武力*/90,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*052护卫*//*统率*/0,/*武力*/80,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*053火攻*//*统率*/0,/*武力*/0,/*智力*/70,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*054言毒*//*统率*/0,/*武力*/0,/*智力*/80,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*055机略*//*统率*/0,/*武力*/0,/*智力*/80,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*056诡计*//*统率*/0,/*武力*/0,/*智力*/80,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*057虚实*//*统率*/0,/*武力*/0,/*智力*/95,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*058妙计*//*统率*/0,/*武力*/0,/*智力*/80,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*059秘计*//*统率*/0,/*武力*/0,/*智力*/80,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*060看破*//*统率*/0,/*武力*/0,/*智力*/80,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*061洞察*//*统率*/80,/*武力*/80,/*智力*/70,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*062火神*//*统率*/0,/*武力*/0,/*智力*/95,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*063神算*//*统率*/0,/*武力*/0,/*智力*/100,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*064百出*//*统率*/0,/*武力*/0,/*智力*/85,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*065鬼谋*//*统率*/0,/*武力*/0,/*智力*/95,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*066连环*//*统率*/0,/*武力*/0,/*智力*/95,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*067深谋*//*统率*/0,/*武力*/0,/*智力*/95,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*068反计*//*统率*/0,/*武力*/0,/*智力*/90,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*069奇谋*//*统率*/0,/*武力*/0,/*智力*/80,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*070妖术*//*统率*/0,/*武力*/0,/*智力*/80,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*071鬼门*//*统率*/0,/*武力*/0,/*智力*/95,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*072规律*//*统率*/0,/*武力*/0,/*智力*/75,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*073沉着*//*统率*/0,/*武力*/0,/*智力*/75,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*074明镜*//*统率*/0,/*武力*/0,/*智力*/85,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*075奏乐*//*统率*/0,/*武力*/0,/*智力*/0,/*政治*/0,/*魅力*/90,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*076诗想*//*统率*/0,/*武力*/0,/*智力*/70,/*政治*/70,/*魅力*/70,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*077筑城*//*统率*/0,/*武力*/0,/*智力*/0,/*政治*/80,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*078屯田*//*统率*/0,/*武力*/0,/*智力*/0,/*政治*/80,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*079名声*//*统率*/0,/*武力*/0,/*智力*/0,/*政治*/0,/*魅力*/90,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*080能吏*//*统率*/0,/*武力*/0,/*智力*/80,/*政治*/80,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*081繁殖*//*统率*/0,/*武力*/0,/*智力*/80,/*政治*/80,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*082发明*//*统率*/0,/*武力*/0,/*智力*/80,/*政治*/80,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*083造船*//*统率*/0,/*武力*/0,/*智力*/70,/*政治*/70,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*084指导*//*统率*/0,/*武力*/0,/*智力*/80,/*政治*/80,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*085眼力*//*统率*/0,/*武力*/0,/*智力*/70,/*政治*/70,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*086论客*//*统率*/0,/*武力*/0,/*智力*/85,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*087积蓄*//*统率*/0,/*武力*/0,/*智力*/0,/*政治*/90,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*088劝农*//*统率*/0,/*武力*/0,/*智力*/0,/*政治*/90,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*089度支*//*统率*/0,/*武力*/0,/*智力*/0,/*政治*/90,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*090平准*//*统率*/0,/*武力*/0,/*智力*/0,/*政治*/90,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*091亲乌*//*统率*/80,/*武力*/80,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/3,/*兵器*/0,/*水军*/0},
	{/*092亲羌*//*统率*/80,/*武力*/80,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/3,/*兵器*/0,/*水军*/0},
	{/*093亲越*//*统率*/80,/*武力*/80,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/3,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*094亲蛮*//*统率*/80,/*武力*/80,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/3,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*095威压*//*统率*/80,/*武力*/80,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/3,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*096仁政*//*统率*/0,/*武力*/0,/*智力*/0,/*政治*/80,/*魅力*/90,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*097风水*//*统率*/0,/*武力*/0,/*智力*/80,/*政治*/80,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*098祈愿*//*统率*/0,/*武力*/0,/*智力*/0,/*政治*/70,/*魅力*/70,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*099内助*//*统率*/0,/*武力*/0,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*100八卦*//*统率*/90,/*武力*/0,/*智力*/90,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*101窥探*//*统率*/70,/*武力*/70,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*102内治*//*统率*/0,/*武力*/0,/*智力*/70,/*政治*/70,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*103戍防*//*统率*/70,/*武力*/70,/*智力*/60,/*政治*/60,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*104韬略*//*统率*/0,/*武力*/0,/*智力*/90,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*105谋略*//*统率*/0,/*武力*/0,/*智力*/90,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*106军略*//*统率*/80,/*武力*/80,/*智力*/80,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*107强募*//*统率*/0,/*武力*/0,/*智力*/0,/*政治*/0,/*魅力*/90,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*108狙击*//*统率*/80,/*武力*/80,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/3,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*109猛骑*//*统率*/80,/*武力*/80,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/3,/*兵器*/0,/*水军*/0},
	{/*110猛卒*//*统率*/80,/*武力*/80,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/2,/*戟*/2,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*111严整*//*统率*/70,/*武力*/70,/*智力*/0,/*政治*/70,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*112辎粮*//*统率*/0,/*武力*/0,/*智力*/0,/*政治*/80,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*113山战*//*统率*/80,/*武力*/80,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/2,/*戟*/2,/*弩*/2,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*114背水*//*统率*/80,/*武力*/80,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/1,/*戟*/1,/*弩*/1,/*马*/1,/*兵器*/0,/*水军*/0},
	{/*115清野*//*统率*/70,/*武力*/70,/*智力*/60,/*政治*/70,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*116拱戍*//*统率*/80,/*武力*/80,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*117布阵*//*统率*/0,/*武力*/0,/*智力*/90,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*118要击*//*统率*/80,/*武力*/80,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/2,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*119商才*//*统率*/0,/*武力*/0,/*智力*/80,/*政治*/70,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*120兵圣*//*统率*/95,/*武力*/80,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/4,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*121兵神*//*统率*/95,/*武力*/70,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*122兵心*//*统率*/95,/*武力*/0,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*123战神*//*统率*/90,/*武力*/100,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/2,/*戟*/2,/*弩*/2,/*马*/2,/*兵器*/0,/*水军*/0},
	{/*124战将*//*统率*/80,/*武力*/90,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/2,/*戟*/2,/*弩*/2,/*马*/2,/*兵器*/0,/*水军*/0},
	{/*125巧变*//*统率*/80,/*武力*/80,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/1,/*戟*/1,/*弩*/1,/*马*/1,/*兵器*/0,/*水军*/0},
	{/*126游侠*//*统率*/70,/*武力*/80,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*127百战*//*统率*/90,/*武力*/90,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/2,/*戟*/2,/*弩*/2,/*马*/2,/*兵器*/0,/*水军*/0},
	{/*128蓄势*//*统率*/80,/*武力*/90,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*129神臂*//*统率*/80,/*武力*/80,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/4,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*130治军*//*统率*/90,/*武力*/0,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*131坚城*//*统率*/80,/*武力*/80,/*智力*/60,/*政治*/60,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*132料敌*//*统率*/0,/*武力*/0,/*智力*/95,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*133陷阵*//*统率*/80,/*武力*/90,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*134恫吓*//*统率*/80,/*武力*/100,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*135破竹*//*统率*/90,/*武力*/95,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/2,/*戟*/2,/*弩*/2,/*马*/3,/*兵器*/0,/*水军*/0},
	{/*136安民*//*统率*/0,/*武力*/0,/*智力*/0,/*政治*/0,/*魅力*/95,/*枪*/1,/*戟*/1,/*弩*/1,/*马*/1,/*兵器*/2,/*水军*/2},
	{/*137循吏*//*统率*/0,/*武力*/0,/*智力*/0,/*政治*/90,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*138贤哲*//*统率*/0,/*武力*/0,/*智力*/0,/*政治*/90,/*魅力*/90,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*139变法*//*统率*/0,/*武力*/0,/*智力*/90,/*政治*/90,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*140法治*//*统率*/0,/*武力*/0,/*智力*/0,/*政治*/95,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*141后勤*//*统率*/0,/*武力*/0,/*智力*/0,/*政治*/80,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*142医者*//*统率*/0,/*武力*/0,/*智力*/80,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*143扰敌*//*统率*/0,/*武力*/0,/*智力*/95,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*144运筹*//*统率*/0,/*武力*/0,/*智力*/100,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*145激励*//*统率*/90,/*武力*/90,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/2,/*戟*/2,/*弩*/2,/*马*/2,/*兵器*/0,/*水军*/0},
	{/*146伯乐*//*统率*/0,/*武力*/0,/*智力*/80,/*政治*/80,/*魅力*/90,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*147清谈*//*统率*/0,/*武力*/0,/*智力*/70,/*政治*/70,/*魅力*/80,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*148军魂*//*统率*/95,/*武力*/90,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/2,/*戟*/2,/*弩*/2,/*马*/2,/*兵器*/1,/*水军*/1},
	{/*149武干*//*统率*/95,/*武力*/0,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*150摧锋*//*统率*/70,/*武力*/70,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/3,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*151重甲*//*统率*/80,/*武力*/80,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/3,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*152轻甲*//*统率*/70,/*武力*/70,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/3,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*153掠阵*//*统率*/80,/*武力*/90,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/4,/*兵器*/0,/*水军*/0},
	{/*154重器*//*统率*/0,/*武力*/0,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/3,/*水军*/0},
	{/*155水师*//*统率*/70,/*武力*/70,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/3},
	{/*156调练*//*统率*/70,/*武力*/70,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*157巡查*//*统率*/70,/*武力*/70,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/0,/*戟*/0,/*弩*/0,/*马*/0,/*兵器*/0,/*水军*/0},
	{/*158劫财*//*统率*/0,/*武力*/80,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/1,/*戟*/1,/*弩*/1,/*马*/1,/*兵器*/0,/*水军*/0},
	{/*159截粮*//*统率*/0,/*武力*/80,/*智力*/0,/*政治*/0,/*魅力*/0,/*枪*/1,/*戟*/1,/*弩*/1,/*马*/1,/*兵器*/0,/*水军*/0}
	};
	Main main;
}